# 81
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
*valid_score, a, b, = scores
print(valid_score)

# 82
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
a, b, *valid_score = scores
print(valid_score)

# 83
scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
a, *valid_score, b = scores
print(valid_score)

# 84
temp = {}
print(temp)

# 85
dict = {"메로나": 1000, "폴라포": 1200, "삥빠레": 1800}
print(dict)

# 86
dict["죠스바"] = 1200
dict["월드콘"] = 1500
print(dict)

# 87
ice = {'메로나': 1000, '폴로포': 1200, '빵빠레': 1800, '죠스바': 1200, '월드콘': 1500, "메로나": 1300}
print("메로나 가격:", dict["메로나"])

# 88
ice = {'메로나': 1000, '폴로포': 1200, '빵빠레': 1800, '죠스바': 1200, '월드콘': 1500}
ice["메로나"] = 1300
print(ice)

# 89
ice = {'메로나': 1000,
       '폴로포': 1200,
       '빵빠레': 1800,
       '죠스바': 1200,
       '월드콘': 1500}
del(ice["메로나"])
print(ice)

# 90

# 딕셔너리에 없는 키를 사용해서 인덱싱하면 오류가 발생한다.